export const product = {
	id: '1',
	name: 'Куряча грудка',
	category: 'Мʼясо',
	image:
		'https://images.unsplash.com/photo-1604908176997-125f25cc6f3d?w=800&h=600&fit=crop',
	calories: 165,
	protein: 31,
	fat: 3.6,
	carbs: 0,
	description:
		"Куряча грудка - відмінне джерело нежирного білка, ідеально підходить для здорового харчування та нарощування м'язової маси.",
	benefits: [
		'Високий вміст білка',
		'Низький вміст жиру',
		'Багатий вітамінами B6 і B12',
		'Містить селен і фосфор',
	],
	vitamins: {
		'Вітамін B6': '0.6 мг',
		'Вітамін B12': '0.3 мкг',
		Ніацин: '13.7 мг',
		Селен: '27 мкг',
	},
};
