export const PAGE_TITLE = {
	home: {
		title: 'Головна',
		description:
			'Mealvy — ваш особистий планувальник харчування та менеджер рецептів. Плануйте свої страви, керуйте рецептами та відкривайте нові страви з детальною інформацією про поживні речовини.',
		keywords: [
			'планувальник харчування',
			'менеджер рецептів',
			'готування',
			'планування їжі',
			'калькулятор калорійності',
		],
	},
	dishes: {
		title: 'Страви та рецепти',
		subtitle: 'Колекція улюблених рецептів з детальними інструкціями',
		description:
			'Відкрийте для себе колекцію улюблених рецептів із детальними інструкціями, інгредієнтами та поживною інформацією.',
		button: 'Додати страву',
		keywords: ['рецепти', 'страви', 'готування', 'їжа', 'інструкції', 'кухня'],
	},
	products: {
		title: 'Продукти',
		subtitle: 'База продуктів з інформацією про КБЖУ',
		description:
			'Досліджуйте нашу базу продуктів із детальною поживною інформацією (КБЖУ). Знаходьте інгредієнти для своїх страв і рецептів.',
		button: 'Додати продукт',
		keywords: [
			'продукти',
			'інгредієнти',
			'харчування',
			'КБЖУ',
			'база даних',
			'поживна інформація',
		],
	},
	favorites: {
		title: 'Обрані рецепти та продукти',
		subtitle: 'Ваша персональна колекція страв й продуктів',
		description:
			'Зберігайте найкращі кулінарні ідеї в одному місці. Ваша персональна колекція улюблених страв на Mealvy.',
		keywords: [
			'обране',
			'улюблені страви',
			'кулінарія',
			'збережені рецепти',
			'Mealvy',
		],
	},
	planer: {
		title: 'Планування меню',
		subtitle: 'Складіть ідеальне меню на тиждень',
		description:
			'Створюйте ідеальний тижневий план меню. Організовуйте свої страви на кожен день тижня.',
		button: 'Зберегти меню',
		keywords: [
			'планувальник меню',
			'тижневе меню',
			'планування харчування',
			'страви',
			'підготовка їжі',
		],
	},
	profile: {
		title: 'Профіль користувача',
		subtitle: 'Керуйте своєю особистою інформацією та налаштуваннями',
		description:
			'Керуйте своїм профілем користувача та налаштуваннями застосунку.',
		keywords: [
			'профіль користувача',
			'особиста інформація',
			'налаштування облікового запису',
			'безпека',
			'конфіденційність',
		],
	},
	schedule: {
		title: 'Розклад харчування',
		subtitle: 'Плануйте і відстежуйте прийоми їжі',
		description:
			'Плануйте та відстежуйте свої страви за допомогою функції розкладу. Організовуйте своє харчування по тижнях або місяцях.',
		keywords: [
			'розклад',
			'планування харчування',
			'відстеження харчування',
			'календар',
			'тижневе меню',
		],
	},
	settings: {
		title: 'Налаштування',
		subtitle: 'Керуйте своїм обліковим записом та параметрами додатку',
		description: 'Налаштуйте параметри та уподобання вашого застосунку.',
		keywords: [
			'налаштування',
			'уподобання',
			'параметри додатку',
			'безпека',
			'сповіщення',
		],
	},
	addProduct: {
		title: 'Додати продукт',
		description:
			'Додайте новий продукт до нашої бази з детальною поживною інформацією.',
		keywords: ['додати продукт', 'новий продукт', 'КБЖУ', 'інгредієнти'],
	},
	editProduct: {
		title: 'Редагувати продукт',
		description:
			'Редагуйте продукт у нашій базі з детальною поживною інформацією.',
		keywords: ['редагувати продукт', 'оновити продукт', 'КБЖУ'],
	},
	addDish: {
		title: 'Додати страву',
		description:
			'Додайте новий рецепт до своєї колекції з інгредієнтами та інструкціями приготування.',
		keywords: ['додати рецепт', 'нова страва', 'готування', 'інструкції'],
	},
	editDish: {
		title: 'Редагувати страву',
		description:
			'Редагуйте рецепт у своїй колекції з інгредієнтами та інструкціями приготування.',
		keywords: ['редагувати рецепт', 'оновити страву', 'готування'],
	},
	shoppingList: {
		title: 'Список покупок',
		description:
			'Ваш список покупок на основі запланованих страв. Відмічайте куплені продукти та експортуйте список.',
		keywords: [
			'список покупок',
			'продукти',
			'інгредієнти',
			'покупки',
			'планування',
		],
	},
	notFound: {
		title: 'Сторінка не знайдена',
		description:
			'Сторінка, яку ви шукаєте, не існує. Поверніться на головну сторінку.',
		keywords: ['404', 'сторінка не знайдена', 'помилка', 'відсутня сторінка'],
	},
};
