export const PAGE_TITLE = {
	dishes: {
		title: 'Страви та рецепти',
		subtitle: 'Колекція улюблених рецептів з детальними інструкціями',
		button: 'Додати страву',
	},
	products: {
		title: 'Продукти',
		subtitle: 'База продуктів з інформацією про КБЖУ',
		button: 'Додати продукт',
	},
	favorites: {
		title: 'Обрані рецепти',
		subtitle: 'Ваша персональна колекція страв й продуктів',
	},
	planer: {
		title: 'Планування меню',
		subtitle: 'Складіть ідеальне меню на тиждень',
		button: 'Зберегти меню',
	},
	profile: {
		title: 'Профіль користувача',
		subtitle: 'Керуйте своєю особистою інформацією та налаштуваннями',
	},
	schedule: {
		title: 'Розклад харчування',
		subtitle: 'Плануйте і відстежуйте прийоми їжі',
	},
	settings: {
		title: 'Налаштування',
		subtitle: 'Керуйте своїм обліковим записом та параметрами додатку',
	},
};
